
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Объект = Ссылка.ПолучитьОбъект();
		цДок = Документы.ДокументУстановкиЦен.СоздатьДокумент();
		цДок.Артикул= ЭтотОбъект.Артикул;
		Запрос=Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 2
	           |	СРЕДНЕЕ(ПоступлениеТоваров.Цена) КАК Цена
	           |ИЗ
	           |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ПоступлениеТоваров.Дата";
		Результат=Запрос.Выполнить().Выгрузить();
		цДок.Наименование = ЭтотОбъект.Наименование;
		цДок.Цена=ЭтотОбъект.Цена;
		цДок.Дата= ЭтотОбъект.Дата;
		цДок.УстановитьНовыйНомер();
		цДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецПроцедуры